-- --------------------------------------------------------
-- Host:                         localhost
-- Server version:               10.1.36-MariaDB - mariadb.org binary distribution
-- Server OS:                    Win32
-- HeidiSQL Version:             9.5.0.5196
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;


-- Dumping database structure for scriptioner
CREATE DATABASE IF NOT EXISTS `scriptioner` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `scriptioner`;

-- Dumping structure for table scriptioner.answers
CREATE TABLE IF NOT EXISTS `answers` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `questionId` int(11) unsigned NOT NULL,
  `answer` varchar(255) NOT NULL,
  `isCorrect` tinyint(3) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `FK_answers_questions` (`questionId`),
  CONSTRAINT `FK_answers_questions` FOREIGN KEY (`questionId`) REFERENCES `questions` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=67 DEFAULT CHARSET=utf8;

-- Dumping data for table scriptioner.answers: ~58 rows (approximately)
/*!40000 ALTER TABLE `answers` DISABLE KEYS */;
INSERT INTO `answers` (`id`, `questionId`, `answer`, `isCorrect`) VALUES
	(1, 1, 'Каберне совиньон', 1),
	(2, 1, 'Совиньон блан', 0),
	(3, 1, 'Мускат', 0),
	(4, 1, 'Шардоне', 0),
	(5, 2, 'Ран Босилек', 1),
	(6, 2, 'Иван Вазов', 0),
	(7, 2, 'Димчо Дебелянов', 0),
	(8, 2, 'Никола Вапцаров', 0),
	(9, 3, 'Светулката', 1),
	(10, 3, 'Щурецът', 0),
	(11, 3, 'Сърничката', 0),
	(12, 3, 'GPS-ът', 0),
	(13, 4, 'На рамо', 1),
	(14, 4, 'На краката', 0),
	(15, 4, 'На китката', 0),
	(16, 4, 'Зад ухото', 0),
	(17, 5, 'Кебапчета за скара', 1),
	(18, 5, 'Туристически обувки', 0),
	(19, 5, 'Ютия', 0),
	(20, 5, 'Мотоциклет', 0),
	(21, 6, 'Имат 6 крайника', 1),
	(22, 6, 'Имат 3 очи', 0),
	(23, 6, 'Нямат коса', 0),
	(24, 6, 'Нямат пръсти', 0),
	(25, 7, 'Елин Пелин и дядо Добри', 1),
	(26, 7, 'Ванга и Ивет Лалова', 0),
	(27, 7, 'Леда Милева и Белослава', 0),
	(28, 7, 'Христо Ботев и Стоичков', 0),
	(29, 8, '60 км', 1),
	(30, 8, '40 км', 0),
	(31, 8, '50 км', 0),
	(32, 8, '80 км', 0),
	(33, 9, 'Представител на Евровизия', 1),
	(34, 9, 'Двойник на президента', 0),
	(35, 9, 'Митничар на годината', 0),
	(36, 9, 'Мистър Свят', 0),
	(37, 10, '20', 1),
	(38, 10, '3', 0),
	(39, 10, '15', 0),
	(40, 10, '6', 0),
	(41, 11, 'Нарязани варени яйца', 1),
	(42, 11, 'Цял морков', 0),
	(43, 11, 'Сушен грах', 0),
	(44, 11, 'Задушение аспержи', 0),
	(45, 12, 'Блато', 1),
	(46, 12, 'Океан', 0),
	(47, 12, 'Река', 0),
	(48, 12, 'Море', 0),
	(49, 13, 'Тенисист', 1),
	(50, 13, 'Тенесист', 0),
	(51, 13, 'Тинисист', 0),
	(52, 13, 'Тинесист', 0),
	(53, 14, 'Злато', 1),
	(54, 14, 'Безсмъртие', 0),
	(55, 14, 'Популярност', 0),
	(56, 14, 'Ревматизъм', 0),
	(57, 15, 'Кухненска маса', 1),
	(58, 15, 'Капан за мишки', 0),
	(59, 15, 'Тенджера за супа', 0),
	(60, 15, 'Кулокран', 0),
	(61, 16, 'Махало', 1),
	(62, 16, 'Локомотив', 0),
	(63, 16, 'Почерпен английски турист', 0),
	(64, 16, 'Бразилски футболист', 0),
	(65, 17, 'Вид повърхност в триизмерно евклидово пространство', 1),
	(66, 17, 'Нещо за ядене', 0);
/*!40000 ALTER TABLE `answers` ENABLE KEYS */;

-- Dumping structure for table scriptioner.questions
CREATE TABLE IF NOT EXISTS `questions` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `question` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=18 DEFAULT CHARSET=utf8;

-- Dumping data for table scriptioner.questions: ~16 rows (approximately)
/*!40000 ALTER TABLE `questions` DISABLE KEYS */;
INSERT INTO `questions` (`id`, `question`) VALUES
	(1, 'От кой от сортовете вино може да се направи розе?'),
	(2, 'Кой е авторът на извесния стих "родна реч, омайна сладка, що звучи навред край мен"?'),
	(3, 'Кой помогнал на "Зайченцето бяло" да се върне при "свойта мила майка" от детската песен?'),
	(4, 'Къде се носят дисагите?'),
	(5, 'Какво в България може да се произведе по утвърден стандарт "Стара Планина"?'),
	(6, 'Кое е общото между кентаврите, ангелите и кучешките бълхи?'),
	(7, 'Село Байлово като родно място е дало на България поне двама видни българи. Кои са те?'),
	(8, 'Колко изминава лодка със скорост 30 км/ч в неподвижна вода, ако плава за по 1 час по и срещу течение от 10 км/ч?'),
	(9, 'Конкурс за какво проведоха румънците в необикновената атмосфера на подземна солна мина?'),
	(10, 'Кое число стои най-отгоре на стандартната мишена за дартс?'),
	(11, 'Кой продукт е класическо допълнение и украса към пролетната зелена салата?'),
	(12, 'Кой от водоемите не спада към романтичните често споменавани в песни и стихове?'),
	(13, 'В кой от отговорите думата е изписана правилно?'),
	(14, 'Какво най-често се надяват да добият хората, които пресяват пясък със сито и леген в реката?'),
	(15, 'Стандартната височина на кое съоражение е около 75 сантиметра?'),
	(16, 'Кой от обектите се движи, защото постоянно се стрми да възвърне равновесното си положение?'),
	(17, 'Какво е параболоид?');
/*!40000 ALTER TABLE `questions` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
