-- --------------------------------------------------------
-- Host:                         localhost
-- Server version:               10.1.36-MariaDB - mariadb.org binary distribution
-- Server OS:                    Win32
-- HeidiSQL Version:             9.5.0.5196
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;


-- Dumping database structure for scriptioner
CREATE DATABASE IF NOT EXISTS `scriptioner` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `scriptioner`;

-- Dumping structure for table scriptioner.questions
CREATE TABLE IF NOT EXISTS `questions` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `question` text NOT NULL,
  `right_answer` text NOT NULL,
  `wrong_answer_1` text NOT NULL,
  `wrong_answer_2` text NOT NULL,
  `wrong_answer_3` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8;

-- Dumping data for table scriptioner.questions: ~16 rows (approximately)
/*!40000 ALTER TABLE `questions` DISABLE KEYS */;
INSERT INTO `questions` (`id`, `question`, `right_answer`, `wrong_answer_1`, `wrong_answer_2`, `wrong_answer_3`) VALUES
	(1, 'От кой от сортовете вино може да се направи розе?', 'Каберне совиньон', 'Совиньон блан', 'Мускат', 'Шардоне'),
	(2, 'Кой е авторът на извесния стих "родна реч, омайна сладка, що звучи навред край мен"?', 'Ран Босилек', 'Иван Вазов', 'Димчо Дебелянов', 'Никола Вапцаров'),
	(3, 'Кой помогнал на "Зайченцето бяло" да се върне при "свойта мила майка" от детската песен?', 'Светулката', 'Щурецът', 'Сърничката', 'GPS-ът'),
	(4, 'Къде се носят дисагите?', 'На рамо', 'На краката', 'На китката', 'Зад ухото'),
	(5, 'Какво в България може да се произведе по утвърден стандарт "Стара Планина"?', 'Кебапчета за скара', 'Туристически обувки', 'Ютия', 'Мотоциклет'),
	(6, 'Кое е общото между кентаврите, ангелите и кучешките бълхи?', 'Имат 6 крайника', 'Имат 3 очи', 'Нямат коса', 'Нямат пръсти'),
	(7, 'Село Байлово като родно място е дало на България поне двама видни българи. Кои са те?', 'Елин Пелин и дядо Добри', 'Ванга и Ивет Лалова', 'Леда Милева и Белослава', 'Христо Ботев и Стоичков'),
	(8, 'Колко изминава лодка със скорост 30 км/ч в неподвижна вода, ако плава за по 1 час по и срещу течение от 10 км/ч?', '60 км', '40 км', '50 км', '80 км'),
	(9, 'Конкурс за какво проведоха румънците в необикновената атмосфера на подземна солна мина?', 'Представител на Евровизия', 'Двойник на президента', 'Митничар на годината', 'Мистър Свят'),
	(10, 'Кое число стои най-отгоре на стандартната мишена за дартс?', '20', '3', '15', '6'),
	(11, 'Кой продукт е класическо допълнение и украса към пролетната зелена салата?', 'Нарязани варени яйца', 'Цял морков', 'Сушен грах', 'Задушение аспержи'),
	(12, 'Кой от водоемите не спада към романтичните често споменавани в песни и стихове?', 'Блато', 'Океан', 'Река', 'Море'),
	(13, 'В кой от отговорите думата е изписана правилно?', 'Тенисист', 'Тенесист', 'Тинисист', 'Тинесист'),
	(14, 'Какво най-често се надяват да добият хората, които пресяват пясък със сито и леген в реката?', 'Злато', 'Безсмъртие', 'Популярност', 'Ревматизъм'),
	(15, 'Стандартната височина на кое съоражение е около 75 сантиметра?', 'Кухненска маса', 'Капан за мишки', 'Тенджера за супа', 'Кулокран'),
	(16, 'Кой от обектите се движи, защото постоянно се стрми да възвърне равновесното си положение?', 'Махало', 'Локомотив', 'Почерпен английски турист', 'Бразилски футболист');
/*!40000 ALTER TABLE `questions` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
